name: "h36mc2f3dhm"
#-------------save training pred skeleton map on MPII and Human3.6M




#-----randomly generate index for h36m
layer {
  name: "gen_rand_ind"
  type: "GenRandIndex"
  top: "image_index"
  gen_rand_index_param {
     index_lower_bound: 0
     index_upper_bound: 1559571
     batch_size: 3
  }
  include {
     phase: TRAIN
  }
}



#-----randomly generate index for h36m
layer {
  name: "gen_rand_ind"
  type: "GenRandIndex"
  top: "image_index"
  gen_rand_index_param {
     index_lower_bound: 1559572
     index_upper_bound: 2108570
     #index_lower_bound: 0
     #index_upper_bound: 1559571
     batch_size: 3
  }
  include {
     phase: TEST
  }
}







#----- Read bbx x1 bbx y1 bbx x2 bbx y2 H36M
layer {
  name: "read_bbx_H36M"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "bbx_H36M"
  read_blob_from_file_indexing_param {
     file_prefix: "/data/wqf/h36m/mine/Human3.6M/bbx_all_new/"
	 num_to_read: 4
  }

 }
 

layer {
 name: "slice_bbx"
 type: "Slice"
 bottom: "bbx_H36M"
 top: "bbx_x1_H36M"
 top: "bbx_y1_H36M"
 top: "bbx_x2_H36M"
 top: "bbx_y2_H36M"
 slice_param {
    axis: 1
	slice_point: 1
	slice_point: 2
	slice_point: 3
 }
}








#=========read objpos.x
layer {
  name: "center_x"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "center_x"
  read_blob_from_file_indexing_param {
     file_prefix: "/data/wqf/h36m/mine/Human3.6M/center_x/"
   num_to_read: 1
  }  
  
}


#=========read objpos.y
layer {
  name: "center_y"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "center_y"
  read_blob_from_file_indexing_param {
     file_prefix: "/data/wqf/h36m/mine/Human3.6M/center_y/"
   num_to_read: 1
  }  
 
}

#========read scale (* 200)
layer {
 name: "scale"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "scale"
  read_blob_from_file_indexing_param {
     file_prefix: "/data/wqf/h36m/mine/Human3.6M/scale/"
   num_to_read: 1
  }  
  
}

#=======/ 200.0
layer {
  name: "scale_provided"
  bottom: "scale"
  top: "scale_provided"
  type: "ScaleVector"
  scale_vector_param {
     scale_factor: 0.005
  }
 
}





#----- Read GT joint 2d raw Human3.6M (on 256 bbx for training)
layer {
  name: "gt_joint_2d_raw_H36M_all"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "gt_joint_2d_raw_H36M_all"
  read_blob_from_file_indexing_param {
     file_prefix: "/data/wqf/h36m/mine/Human3.6M/gt_joint_2d_raw_new/"
     num_to_read: 64
  }  
  
}






#======= during training because of data aug "crop_gt_joint_2d" is augmented joint 2d in cropped bbx (16 joints)
layer {
  name: "gt_joint_2d_raw_H36M"
  type: "DeepHumanModelConvert2D"
  bottom: "gt_joint_2d_raw_H36M_all"
  top: "gt_joint_2d_raw_H36M"
 
}


#=======generate unified augmented image and augmented 2d annotation (name gt joint 2d raw H36M all is a bit tricky)
layer {
  type: "GenUnifiedDataAndLabel"
  bottom: "image_index"
  bottom: "center_x"
  bottom: "center_y"
  bottom: "scale_provided"
  bottom: "gt_joint_2d_raw_H36M"
  top: "image"
  top: "crop_gt_joint_2d_scale" 

  transform_param {
    stride: 4
    max_rotate_degree: 40.0
    crop_size_x: 256
    crop_size_y: 256
    scale_prob: 1.0
    scale_min: 0.699999988079
    scale_max: 1.29999995232
    #target_dist: 1.17100000381
    target_dist: 1.0
    center_perterb_max: 0.0
    do_clahe: false
    put_gaussian: false
    file_name_file_prefix:  "/data/wqf/h36m/mine/Human3.6M/image_path_file/"
    transform_body_joint: true
    num_parts: 16
    minus_pixel_value: 128.0
  }
  include {
    phase: TRAIN
  }
}




#=======generate unified augmented image and augmented 2d annotation (name gt joint 2d raw H36M all is a bit tricky)
layer {
  type: "GenUnifiedDataAndLabel"
  bottom: "image_index"
  bottom: "center_x"
  bottom: "center_y"
  bottom: "scale_provided"
  bottom: "gt_joint_2d_raw_H36M"
  top: "image"
  top: "crop_gt_joint_2d_scale" 

  transform_param {
    stride: 4
    max_rotate_degree: 0.0
    crop_size_x: 256
    crop_size_y: 256
    scale_prob: -1.0
    flip_prob: -1.0
    scale_min: 0.699999988079
    scale_max: 1.29999995232
    #target_dist: 1.17100000381
    target_dist: 1.0
    center_perterb_max: 0.0
    do_clahe: false
    put_gaussian: false
    file_name_file_prefix:  "/data/wqf/h36m/mine/Human3.6M/image_path_file/"
    transform_body_joint: true
    num_parts: 16
    minus_pixel_value: 128.0
  }
  include {
    phase: TEST
  }
}





#======to get [0, 256] cropped gt 2d -> cropped gt 2d in range [0, 1]
layer {
 type: "ScaleVector"
 bottom: "crop_gt_joint_2d_scale"
 top: "crop_gt_joint_2d"
 name: "crop_gt_joint_2d"
 scale_vector_param {
    scale_factor: 0.00390625
 }
 
}




#----- Read gt mono 3d
layer {
  name: "gt_joint_3d_mono_raw_all"
  type: "ReadBlobFromFileIndexing"
  bottom: "image_index"
  top: "gt_joint_3d_mono_raw_all"
  read_blob_from_file_indexing_param {
     file_prefix: "/data/wqf/h36m/mine/Human3.6M/gt_joint_3d_mono_raw/"
     num_to_read: 96
  }  
}






#======= 32 -> 16
layer {
  name: "gt_joint_3d_mono_raw"
  type: "DeepHumanModelConvert3D"
  bottom: "gt_joint_3d_mono_raw_all"
  top: "gt_joint_3d_mono_raw"
}


#========aug 2D -> aug 3D
layer {
  type: "DeepHumanModelH36MGenAug3D"
  bottom: "crop_gt_joint_2d_scale"
  bottom: "gt_joint_3d_mono_raw"
  bottom: "bbx_x1_H36M"
  bottom: "bbx_y1_H36M"
  bottom: "bbx_x2_H36M"
  bottom: "bbx_y2_H36M"
  bottom: "image_index"
  top: "aug_3d"
  name: "aug_3d"
  gen_aug_3d_param {
      joint_num: 16
      camera_parameters_prefix: "/data/wqf/h36m/mine/Human3.6M/camera_all/"
      crop_bbx_size: 256
  }
  
}

#=======convert current annotation 3D -> only depth annotation
layer {
  type: "DeepHumanModelConvertDepth"
  bottom: "aug_3d"
  bottom: "gt_joint_3d_mono_raw"
  top: "annot_depth"
  name: "annot_depth"
  convert_depth_param {
      joint_num: 16
      depth_lb:  -1005.185902
      depth_ub:  980.8599
      root_joint_id: 0
  }
  
}




#=======generate 2d heatmap ground truth
layer {
  type: "GenHeatmapAllChannels"
  bottom: "crop_gt_joint_2d"
  top: "label_2dhm"
  name: "label_2dhm"
  gen_heatmap_all_channels_param {
       gen_size: 64
       all_one: false
       joint_num: 16
       use_baseline_render: true
       use_cpm_render: false
       stride: 4
       render_sigma: 2
  }
}

#=====generate 3d heatmap ground truth

layer {
  name: "gen_3d_hm"
  bottom: "annot_depth"
  bottom: "crop_gt_joint_2d"

  top: "label_3dhm"
  type: "DeepHumanModelGen3DHeatmapInMoreDetailV3"
  deep_human_model_gen_3d_heatmap_in_more_detail_v3_param {
    depth_dims: 2
  map_size: 64
  crop_size: 256

  stride: 4
  render_sigma: 2
  x_lower_bound: 0.0
  x_upper_bound: 1.0
  y_lower_bound: 0.0
  y_upper_bound: 1.0
  z_lower_bound: 0.0
  z_upper_bound: 1.0

  
  joint_num: 16
  }
}




layer {
 name: "conv_1"
 type: "Convolution" 
 bottom: "image"
 top: "conv_1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 64
 pad: 3
 kernel_size: 7
 stride:2
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 
 }
 
 
 
 
 
layer {
 name: "bn_1"
 type: "BatchNorm" 
 bottom: "conv_1" 
 top: "bn_1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "bn_1"
 type: "BatchNorm" 
 bottom: "conv_1" 
 top: "bn_1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "scale_1"
 type: "Scale" 
 bottom: "bn_1" 
 top: "scale_1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_1_branch1_bn1"
 type: "BatchNorm" 
 bottom: "scale_1" 
 top: "residual_1_branch1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "residual_1_branch1_bn1"
 type: "BatchNorm" 
 bottom: "scale_1" 
 top: "residual_1_branch1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "residual_1_branch1_scale1"
 type: "Scale" 
 bottom: "residual_1_branch1_bn1" 
 top: "residual_1_branch1_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_1_branch1_relu1"
 type: "ReLU" 
 bottom: "residual_1_branch1_scale1" 
 top: "residual_1_branch1_relu1" 
}
layer {
 name: "residual_1_branch1_conv1"
 type: "Convolution" 
 bottom: "residual_1_branch1_relu1" 
 top: "residual_1_branch1_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 64
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_1_branch1_bn2"
 type: "BatchNorm" 
 bottom: "residual_1_branch1_conv1" 
 top: "residual_1_branch1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "residual_1_branch1_bn2"
 type: "BatchNorm" 
 bottom: "residual_1_branch1_conv1" 
 top: "residual_1_branch1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "residual_1_branch1_scale2"
 type: "Scale" 
 bottom: "residual_1_branch1_bn2" 
 top: "residual_1_branch1_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_1_branch1_relu2"
 type: "ReLU" 
 bottom: "residual_1_branch1_scale2" 
 top: "residual_1_branch1_relu2" 
}
layer {
 name: "residual_1_branch1_conv2"
 type: "Convolution" 
 bottom: "residual_1_branch1_relu2" 
 top: "residual_1_branch1_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 64
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_1_branch1_bn3"
 type: "BatchNorm" 
 bottom: "residual_1_branch1_conv2" 
 top: "residual_1_branch1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "residual_1_branch1_bn3"
 type: "BatchNorm" 
 bottom: "residual_1_branch1_conv2" 
 top: "residual_1_branch1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "residual_1_branch1_scale3"
 type: "Scale" 
 bottom: "residual_1_branch1_bn3" 
 top: "residual_1_branch1_scale3" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_1_branch1_relu3"
 type: "ReLU" 
 bottom: "residual_1_branch1_scale3" 
 top: "residual_1_branch1_relu3" 
}
layer {
 name: "residual_1_branch1_conv3"
 type: "Convolution" 
 bottom: "residual_1_branch1_relu3" 
 top: "residual_1_branch1_conv3" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_1_branch2_conv"
 type: "Convolution" 
 bottom: "scale_1" 
 top: "residual_1_branch2_conv" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_1"
 type: "Eltwise" 
 bottom: "residual_1_branch1_conv3" 
 top: "residual_1" 
 bottom: "residual_1_branch2_conv" 
 eltwise_param { 
 operation: SUM 
 } 
 }
layer {
 name: "pooling"
 type: "Pooling" 
 bottom: "residual_1" 
 top: "pooling" 
 pooling_param { 
 pool: MAX 
 kernel_size: 2 
 stride: 2 
 } 
 }
layer {
 name: "residual_2_branch1_bn1"
 type: "BatchNorm" 
 bottom: "pooling" 
 top: "residual_2_branch1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "residual_2_branch1_bn1"
 type: "BatchNorm" 
 bottom: "pooling" 
 top: "residual_2_branch1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "residual_2_branch1_scale1"
 type: "Scale" 
 bottom: "residual_2_branch1_bn1" 
 top: "residual_2_branch1_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_2_branch1_relu1"
 type: "ReLU" 
 bottom: "residual_2_branch1_scale1" 
 top: "residual_2_branch1_relu1" 
}
layer {
 name: "residual_2_branch1_conv1"
 type: "Convolution" 
 bottom: "residual_2_branch1_relu1" 
 top: "residual_2_branch1_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 64
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_2_branch1_bn2"
 type: "BatchNorm" 
 bottom: "residual_2_branch1_conv1" 
 top: "residual_2_branch1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "residual_2_branch1_bn2"
 type: "BatchNorm" 
 bottom: "residual_2_branch1_conv1" 
 top: "residual_2_branch1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "residual_2_branch1_scale2"
 type: "Scale" 
 bottom: "residual_2_branch1_bn2" 
 top: "residual_2_branch1_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_2_branch1_relu2"
 type: "ReLU" 
 bottom: "residual_2_branch1_scale2" 
 top: "residual_2_branch1_relu2" 
}
layer {
 name: "residual_2_branch1_conv2"
 type: "Convolution" 
 bottom: "residual_2_branch1_relu2" 
 top: "residual_2_branch1_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 64
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_2_branch1_bn3"
 type: "BatchNorm" 
 bottom: "residual_2_branch1_conv2" 
 top: "residual_2_branch1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "residual_2_branch1_bn3"
 type: "BatchNorm" 
 bottom: "residual_2_branch1_conv2" 
 top: "residual_2_branch1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "residual_2_branch1_scale3"
 type: "Scale" 
 bottom: "residual_2_branch1_bn3" 
 top: "residual_2_branch1_scale3" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_2_branch1_relu3"
 type: "ReLU" 
 bottom: "residual_2_branch1_scale3" 
 top: "residual_2_branch1_relu3" 
}
layer {
 name: "residual_2_branch1_conv3"
 type: "Convolution" 
 bottom: "residual_2_branch1_relu3" 
 top: "residual_2_branch1_conv3" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_2_branch2_conv"
 type: "Convolution" 
 bottom: "pooling" 
 top: "residual_2_branch2_conv" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_2"
 type: "Eltwise" 
 bottom: "residual_2_branch1_conv3" 
 top: "residual_2" 
 bottom: "residual_2_branch2_conv" 
 eltwise_param { 
 operation: SUM 
 } 
 }
layer {
 name: "residual_3_branch1_bn1"
 type: "BatchNorm" 
 bottom: "residual_2" 
 top: "residual_3_branch1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "residual_3_branch1_bn1"
 type: "BatchNorm" 
 bottom: "residual_2" 
 top: "residual_3_branch1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "residual_3_branch1_scale1"
 type: "Scale" 
 bottom: "residual_3_branch1_bn1" 
 top: "residual_3_branch1_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_3_branch1_relu1"
 type: "ReLU" 
 bottom: "residual_3_branch1_scale1" 
 top: "residual_3_branch1_relu1" 
}
layer {
 name: "residual_3_branch1_conv1"
 type: "Convolution" 
 bottom: "residual_3_branch1_relu1" 
 top: "residual_3_branch1_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 64
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_3_branch1_bn2"
 type: "BatchNorm" 
 bottom: "residual_3_branch1_conv1" 
 top: "residual_3_branch1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "residual_3_branch1_bn2"
 type: "BatchNorm" 
 bottom: "residual_3_branch1_conv1" 
 top: "residual_3_branch1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "residual_3_branch1_scale2"
 type: "Scale" 
 bottom: "residual_3_branch1_bn2" 
 top: "residual_3_branch1_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_3_branch1_relu2"
 type: "ReLU" 
 bottom: "residual_3_branch1_scale2" 
 top: "residual_3_branch1_relu2" 
}
layer {
 name: "residual_3_branch1_conv2"
 type: "Convolution" 
 bottom: "residual_3_branch1_relu2" 
 top: "residual_3_branch1_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 64
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_3_branch1_bn3"
 type: "BatchNorm" 
 bottom: "residual_3_branch1_conv2" 
 top: "residual_3_branch1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "residual_3_branch1_bn3"
 type: "BatchNorm" 
 bottom: "residual_3_branch1_conv2" 
 top: "residual_3_branch1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "residual_3_branch1_scale3"
 type: "Scale" 
 bottom: "residual_3_branch1_bn3" 
 top: "residual_3_branch1_scale3" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_3_branch1_relu3"
 type: "ReLU" 
 bottom: "residual_3_branch1_scale3" 
 top: "residual_3_branch1_relu3" 
}
layer {
 name: "residual_3_branch1_conv3"
 type: "Convolution" 
 bottom: "residual_3_branch1_relu3" 
 top: "residual_3_branch1_conv3" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_3_branch2_conv"
 type: "Convolution" 
 bottom: "residual_2" 
 top: "residual_3_branch2_conv" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_3"
 type: "Eltwise" 
 bottom: "residual_3_branch1_conv3" 
 top: "residual_3" 
 bottom: "residual_3_branch2_conv" 
 eltwise_param { 
 operation: SUM 
 } 
 }
layer {
 name: "residual_4_branch1_bn1"
 type: "BatchNorm" 
 bottom: "residual_3" 
 top: "residual_4_branch1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "residual_4_branch1_bn1"
 type: "BatchNorm" 
 bottom: "residual_3" 
 top: "residual_4_branch1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "residual_4_branch1_scale1"
 type: "Scale" 
 bottom: "residual_4_branch1_bn1" 
 top: "residual_4_branch1_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_4_branch1_relu1"
 type: "ReLU" 
 bottom: "residual_4_branch1_scale1" 
 top: "residual_4_branch1_relu1" 
}
layer {
 name: "residual_4_branch1_conv1"
 type: "Convolution" 
 bottom: "residual_4_branch1_relu1" 
 top: "residual_4_branch1_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_4_branch1_bn2"
 type: "BatchNorm" 
 bottom: "residual_4_branch1_conv1" 
 top: "residual_4_branch1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "residual_4_branch1_bn2"
 type: "BatchNorm" 
 bottom: "residual_4_branch1_conv1" 
 top: "residual_4_branch1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "residual_4_branch1_scale2"
 type: "Scale" 
 bottom: "residual_4_branch1_bn2" 
 top: "residual_4_branch1_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_4_branch1_relu2"
 type: "ReLU" 
 bottom: "residual_4_branch1_scale2" 
 top: "residual_4_branch1_relu2" 
}
layer {
 name: "residual_4_branch1_conv2"
 type: "Convolution" 
 bottom: "residual_4_branch1_relu2" 
 top: "residual_4_branch1_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_4_branch1_bn3"
 type: "BatchNorm" 
 bottom: "residual_4_branch1_conv2" 
 top: "residual_4_branch1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "residual_4_branch1_bn3"
 type: "BatchNorm" 
 bottom: "residual_4_branch1_conv2" 
 top: "residual_4_branch1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "residual_4_branch1_scale3"
 type: "Scale" 
 bottom: "residual_4_branch1_bn3" 
 top: "residual_4_branch1_scale3" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "residual_4_branch1_relu3"
 type: "ReLU" 
 bottom: "residual_4_branch1_scale3" 
 top: "residual_4_branch1_relu3" 
}
layer {
 name: "residual_4_branch1_conv3"
 type: "Convolution" 
 bottom: "residual_4_branch1_relu3" 
 top: "residual_4_branch1_conv3" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_4_branch2_conv"
 type: "Convolution" 
 bottom: "residual_3" 
 top: "residual_4_branch2_conv" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "residual_4"
 type: "Eltwise" 
 bottom: "residual_4_branch1_conv3" 
 top: "residual_4" 
 bottom: "residual_4_branch2_conv" 
 eltwise_param { 
 operation: SUM 
 } 
 }
layer {
 name: "hourglass1_pooling"
 type: "Pooling" 
 bottom: "residual_4" 
 top: "hourglass1_pooling" 
 pooling_param { 
 pool: MAX 
 kernel_size: 2 
 stride: 2 
 } 
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_pooling" 
 top: "hourglass1_branch1_res1_branch1_sub1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_pooling" 
 top: "hourglass1_branch1_res1_branch1_sub1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_scale1"
 type: "Scale" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_bn1" 
 top: "hourglass1_branch1_res1_branch1_sub1_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_relu1"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_scale1" 
 top: "hourglass1_branch1_res1_branch1_sub1_relu1" 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_conv1"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_relu1" 
 top: "hourglass1_branch1_res1_branch1_sub1_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_conv1" 
 top: "hourglass1_branch1_res1_branch1_sub1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_conv1" 
 top: "hourglass1_branch1_res1_branch1_sub1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_scale2"
 type: "Scale" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_bn2" 
 top: "hourglass1_branch1_res1_branch1_sub1_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_relu2"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_scale2" 
 top: "hourglass1_branch1_res1_branch1_sub1_relu2" 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_conv2"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_relu2" 
 top: "hourglass1_branch1_res1_branch1_sub1_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_bn3"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_conv2" 
 top: "hourglass1_branch1_res1_branch1_sub1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_bn3"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_conv2" 
 top: "hourglass1_branch1_res1_branch1_sub1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_scale3"
 type: "Scale" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_bn3" 
 top: "hourglass1_branch1_res1_branch1_sub1_scale3" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_relu3"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_scale3" 
 top: "hourglass1_branch1_res1_branch1_sub1_relu3" 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub1_conv3"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_relu3" 
 top: "hourglass1_branch1_res1_branch1_sub1_conv3" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_pooling" 
 top: "hourglass1_branch1_res1_branch1_sub2_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_pooling" 
 top: "hourglass1_branch1_res1_branch1_sub2_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_scale1"
 type: "Scale" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_bn1" 
 top: "hourglass1_branch1_res1_branch1_sub2_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_relu1"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_scale1" 
 top: "hourglass1_branch1_res1_branch1_sub2_relu1" 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_conv1"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_relu1" 
 top: "hourglass1_branch1_res1_branch1_sub2_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_conv1" 
 top: "hourglass1_branch1_res1_branch1_sub2_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_conv1" 
 top: "hourglass1_branch1_res1_branch1_sub2_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_scale2"
 type: "Scale" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_bn2" 
 top: "hourglass1_branch1_res1_branch1_sub2_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_relu2"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_scale2" 
 top: "hourglass1_branch1_res1_branch1_sub2_relu2" 
}
layer {
 name: "hourglass1_branch1_res1_branch1_sub2_conv2"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_relu2" 
 top: "hourglass1_branch1_res1_branch1_sub2_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_concat"
 type: "Concat" 
 bottom: "hourglass1_branch1_res1_branch1_sub1_conv3" 
 top: "hourglass1_branch1_res1_branch1_concat" 
 bottom: "hourglass1_branch1_res1_branch1_sub2_conv2"
 concat_param { 
 axis: 1
 } 
}
layer {
 name: "hourglass1_branch1_res1_branch1_conv_linear"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res1_branch1_concat" 
 top: "hourglass1_branch1_res1_branch1_conv_linear" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1_branch1_linear_batch"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1_branch1_conv_linear" 
 top: "hourglass1_branch1_res1_branch1_linear_batch" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "hourglass1_branch1_res1_branch1_linear_batch"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1_branch1_conv_linear" 
 top: "hourglass1_branch1_res1_branch1_linear_batch" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "hourglass1_branch1_res1_branch1_linear_scale"
 type: "Scale" 
 bottom: "hourglass1_branch1_res1_branch1_linear_batch" 
 top: "hourglass1_branch1_res1_branch1_linear_scale" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res1_branch2_conv"
 type: "Convolution" 
 bottom: "hourglass1_pooling" 
 top: "hourglass1_branch1_res1_branch2_conv" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res1"
 type: "Eltwise" 
 bottom: "hourglass1_branch1_res1_branch1_linear_scale" 
 top: "hourglass1_branch1_res1" 
 bottom: "hourglass1_branch1_res1_branch2_conv" 
 eltwise_param { 
 operation: SUM 
 } 
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1" 
 top: "hourglass1_branch1_res2_branch1_sub1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1" 
 top: "hourglass1_branch1_res2_branch1_sub1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_scale1"
 type: "Scale" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_bn1" 
 top: "hourglass1_branch1_res2_branch1_sub1_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_relu1"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_scale1" 
 top: "hourglass1_branch1_res2_branch1_sub1_relu1" 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_conv1"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_relu1" 
 top: "hourglass1_branch1_res2_branch1_sub1_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_conv1" 
 top: "hourglass1_branch1_res2_branch1_sub1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_conv1" 
 top: "hourglass1_branch1_res2_branch1_sub1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_scale2"
 type: "Scale" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_bn2" 
 top: "hourglass1_branch1_res2_branch1_sub1_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_relu2"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_scale2" 
 top: "hourglass1_branch1_res2_branch1_sub1_relu2" 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_conv2"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_relu2" 
 top: "hourglass1_branch1_res2_branch1_sub1_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_bn3"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_conv2" 
 top: "hourglass1_branch1_res2_branch1_sub1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_bn3"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_conv2" 
 top: "hourglass1_branch1_res2_branch1_sub1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_scale3"
 type: "Scale" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_bn3" 
 top: "hourglass1_branch1_res2_branch1_sub1_scale3" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_relu3"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_scale3" 
 top: "hourglass1_branch1_res2_branch1_sub1_relu3" 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub1_conv3"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_relu3" 
 top: "hourglass1_branch1_res2_branch1_sub1_conv3" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1" 
 top: "hourglass1_branch1_res2_branch1_sub2_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res1" 
 top: "hourglass1_branch1_res2_branch1_sub2_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_scale1"
 type: "Scale" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_bn1" 
 top: "hourglass1_branch1_res2_branch1_sub2_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_relu1"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_scale1" 
 top: "hourglass1_branch1_res2_branch1_sub2_relu1" 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_conv1"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_relu1" 
 top: "hourglass1_branch1_res2_branch1_sub2_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_conv1" 
 top: "hourglass1_branch1_res2_branch1_sub2_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_conv1" 
 top: "hourglass1_branch1_res2_branch1_sub2_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_scale2"
 type: "Scale" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_bn2" 
 top: "hourglass1_branch1_res2_branch1_sub2_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_relu2"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_scale2" 
 top: "hourglass1_branch1_res2_branch1_sub2_relu2" 
}
layer {
 name: "hourglass1_branch1_res2_branch1_sub2_conv2"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_relu2" 
 top: "hourglass1_branch1_res2_branch1_sub2_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_concat"
 type: "Concat" 
 bottom: "hourglass1_branch1_res2_branch1_sub1_conv3" 
 top: "hourglass1_branch1_res2_branch1_concat" 
 bottom: "hourglass1_branch1_res2_branch1_sub2_conv2"
 concat_param { 
 axis: 1
 } 
}
layer {
 name: "hourglass1_branch1_res2_branch1_conv_linear"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res2_branch1_concat" 
 top: "hourglass1_branch1_res2_branch1_conv_linear" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2_branch1_linear_batch"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2_branch1_conv_linear" 
 top: "hourglass1_branch1_res2_branch1_linear_batch" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "hourglass1_branch1_res2_branch1_linear_batch"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2_branch1_conv_linear" 
 top: "hourglass1_branch1_res2_branch1_linear_batch" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "hourglass1_branch1_res2_branch1_linear_scale"
 type: "Scale" 
 bottom: "hourglass1_branch1_res2_branch1_linear_batch" 
 top: "hourglass1_branch1_res2_branch1_linear_scale" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res2_branch2_conv"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res1" 
 top: "hourglass1_branch1_res2_branch2_conv" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 256
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res2"
 type: "Eltwise" 
 bottom: "hourglass1_branch1_res2_branch1_linear_scale" 
 top: "hourglass1_branch1_res2" 
 bottom: "hourglass1_branch1_res2_branch2_conv" 
 eltwise_param { 
 operation: SUM 
 } 
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2" 
 top: "hourglass1_branch1_res3_branch1_sub1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_bn1"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res2" 
 top: "hourglass1_branch1_res3_branch1_sub1_bn1" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_scale1"
 type: "Scale" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_bn1" 
 top: "hourglass1_branch1_res3_branch1_sub1_scale1" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_relu1"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_scale1" 
 top: "hourglass1_branch1_res3_branch1_sub1_relu1" 
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_conv1"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_relu1" 
 top: "hourglass1_branch1_res3_branch1_sub1_conv1" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 0
 kernel_size: 1
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_conv1" 
 top: "hourglass1_branch1_res3_branch1_sub1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_bn2"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_conv1" 
 top: "hourglass1_branch1_res3_branch1_sub1_bn2" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_scale2"
 type: "Scale" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_bn2" 
 top: "hourglass1_branch1_res3_branch1_sub1_scale2" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_relu2"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_scale2" 
 top: "hourglass1_branch1_res3_branch1_sub1_relu2" 
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_conv2"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_relu2" 
 top: "hourglass1_branch1_res3_branch1_sub1_conv2" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
 bias_filler {
 type: "constant"
 }
 }
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_bn3"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_conv2" 
 top: "hourglass1_branch1_res3_branch1_sub1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TRAIN 
 } 
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_bn3"
 type: "BatchNorm" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_conv2" 
 top: "hourglass1_branch1_res3_branch1_sub1_bn3" 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 param { 
 lr_mult: 0 
 } 
 batch_norm_param { 
    use_global_stats: false
 } 
 include { 
  phase: TEST 
 } 
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_scale3"
 type: "Scale" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_bn3" 
 top: "hourglass1_branch1_res3_branch1_sub1_scale3" 
 scale_param { 
 bias_term: true 
 } 
 }
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_relu3"
 type: "ReLU" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_scale3" 
 top: "hourglass1_branch1_res3_branch1_sub1_relu3" 
}
layer {
 name: "hourglass1_branch1_res3_branch1_sub1_conv3"
 type: "Convolution" 
 bottom: "hourglass1_branch1_res3_branch1_sub1_relu3" 
 top: "hourglass1_branch1_res3_branch1_sub1_conv3" 
  param {
 	 lr_mult: 1
 	 decay_mult: 1
 }
 param {
 	 lr_mult: 2
 	 decay_mult: 0
 }
 convolution_param { 
 num_output: 128
 pad: 1
 kernel_size: 3
 stride:1
 weight_filler { 
 type: "gaussian"
 std: 0.01
 }
